[
  {
    "q": "次のうち、ソフトウェア開発におけるウォーターフォールモデルの特徴として正しいものはどれか",
    "options": [
      "開発プロセスが反復的である。",
      "各工程が明確に分離されている。",
      "顧客とのコミュニケーションを重視する。",
      "テスト工程が開発の初期段階で行われる。"
    ],
    "answer": 1,
    "explanation": "ウォーターフォールモデルは、各工程が明確に分離され、順番に進む開発手法である。"
  },
  {
    "q": "次のうち、ソフトウェア開発におけるアジャイル開発の特徴として正しいものはどれか",
    "options": [
      "ウォーターフォールモデルに基づいて開発を行う。",
      "顧客とのコミュニケーションを重視し、短期間で反復的に開発を行う。",
      "ドキュメントを重視し、詳細な仕様書を作成する。",
      "開発チームが独立して作業を進めることが求められる。"
    ],
    "answer": 1,
    "explanation": "アジャイル開発は、顧客とのコミュニケーションと短期間での反復的な開発を重視する手法である。"
  },
  {
    "q": "次のうち、ソフトウェア開発におけるバージョン管理システムの目的として正しいものはどれか",
    "options": [
      "ソフトウェアの実行速度を向上させる。",
      "ソフトウェアのコードを暗号化する。",
      "ソフトウェアの変更履歴を管理する。",
      "ソフトウェアのユーザーインターフェースを改善する。"
    ],
    "answer": 2,
    "explanation": "バージョン管理システムは、ソフトウェアの変更履歴を管理し、複数人での共同開発を容易にするために使用される。"
  },
  {
    "q": "次のうち、ソフトウェア開発におけるリファクタリングの目的として正しいものはどれか",
    "options": [
      "ソフトウェアの機能を追加するために使用される。",
      "ソフトウェアのコードを最適化し、可読性を向上させるために使用される。",
      "ソフトウェアのバグを修正するために使用される。",
      "ソフトウェアのパフォーマンスを向上させるために使用される。"
    ],
    "answer": 1,
    "explanation": "リファクタリングは、ソフトウェアのコードを最適化し、可読性や保守性を向上させるために行われる。"
  },
  {
    "q": "次のうち、ソフトウェア開発におけるユニットテストの目的として正しいものはどれか",
    "options": [
      "ソフトウェアの機能を追加するために使用される。",
      "ソフトウェアのコードを他の開発者と共有し、品質を向上させるために使用される。",
      "ソフトウェアの個々の部品（ユニット）を検証し、バグを早期に発見するために使用される。",
      "ソフトウェアのパフォーマンスを測定するために使用される。"
    ],
    "answer": 2,
    "explanation": "ユニットテストは、ソフトウェアの個々の部品（ユニット）を検証し、バグを早期に発見するために行われる。"
  },
  {
    "q": "次のうち、ソフトウェア開発におけるテストの目的として正しいものはどれか",
    "options": [
      "ソフトウェアの機能を追加する。",
      "ソフトウェアのバグを修正する。",
      "ソフトウェアが仕様通りに動作することを確認する。",
      "ソフトウェアのパフォーマンスを向上させる。"
    ],
    "answer": 2,
    "explanation": "テストは、ソフトウェアが仕様通りに動作することを確認し、品質を保証するために行われる。"
  },
  {
    "q": "次のPythonコードを実行したときの出力として正しいものはどれか。 print(sum([i for i in range(1, 6)]))",
    "options": ["10","15","20","21"],
    "answer": 1,
    "explanation": "リスト [1,2,3,4,5] の合計は15である。"
  },
  {
    "q": "次のアルゴリズムの説明として正しいものはどれか。 「線形探索は、探索対象のリストを先頭から順番に調べていき、目的の値を見つけるまで続けるアルゴリズムである。」",
    "options": [
      "探索対象のリストが整列されている必要がある。",
      "高速な探索を実現するためにヒープ構造を利用する。",
      "探索対象のリストの順序に関係なく使用できる。",
      "探索対象のリストが二分木である必要がある。"
    ],
    "answer": 2,
    "explanation": "線形探索は、整列や構造に関係なく使える探索方法である。"
  },
  {
    "q": "ソフトウェアテストにおけるブラックボックステストの説明として正しいものはどれか。",
    "options": [
      "ソースコードを参照して内部構造を確認しながら行う。",
      "外部仕様に基づいて入力と出力のみを検証する。",
      "すべての分岐とパスを網羅することを目的とする。",
      "ソフトウェアの開発者によって実施される。"
    ],
    "answer": 1,
    "explanation": "ブラックボックステストは、外部仕様に基づいて行うもので、内部構造を考慮しない。"
  },
  {
    "q": "次のうち、探索に二分探索法が適用できる条件として正しいものはどれか。",
    "options": [
      "データがランダムに並んでいる必要がある。",
      "データがあらかじめ整列（ソート）されている必要がある。",
      "データがリンクリストで管理されている必要がある。",
      "データがツリー構造で表現されている必要がある。"
    ],
    "answer": 1,
    "explanation": "二分探索法は、探索対象が整列されている必要がある。"
  },
  {
    "q": "次のうち、キャッシュメモリの役割として最も適切なものはどれか。",
    "options": [
      "CPUの計算速度を落とす。",
      "主記憶の容量を増やす。",
      "CPUと主記憶の間のアクセス速度の差を埋める。",
      "プログラムのバグを自動的に修正する。"
    ],
    "answer": 2,
    "explanation": "キャッシュメモリはCPUと主記憶の間の速度差を補うために使用される。"
  },
  {
    "q": "オペレーティングシステムにおける仮想記憶の説明として正しいものはどれか。",
    "options": [
      "実際の記憶容量を増やす。",
      "記憶装置の寿命を延ばす。",
      "主記憶に収まらないプログラムを実行できるようにする。",
      "OSを高速化するために利用される。"
    ],
    "answer": 2,
    "explanation": "仮想記憶は主記憶の容量を超えるプログラムを実行可能にする仕組みである。"
  },
  {
    "q": "次のうち、パケットフィルタリング型ファイアウォールの特徴として正しいものはどれか。",
    "options": [
      "アプリケーション層での内容を確認して通信を制御する。",
      "IPアドレスやポート番号などに基づいて通信を制御する。",
      "ユーザ認証を行うことができる。",
      "暗号化通信の内容を復号して確認できる。"
    ],
    "answer": 1,
    "explanation": "パケットフィルタリング型ファイアウォールはIPやポート番号に基づいて通信を制御する。"
  },
  {
    "q": "次のうち、HTTPS通信の特徴として正しいものはどれか。",
    "options": [
      "通信内容が平文で送信される。",
      "通信相手の正当性が確認されない。",
      "通信内容が暗号化されて送信される。",
      "通信にはUDPを使用する。"
    ],
    "answer": 2,
    "explanation": "HTTPSはSSL/TLSを使って通信内容を暗号化する。"
  },
  {
    "q": "プロジェクトマネジメントにおける「プロジェクト憲章」とは何か？",
    "options": [
      "プロジェクトの目的や範囲を定義した文書である。",
      "プロジェクトチームのメンバーを決定するための会議である。",
      "プロジェクトの進捗を報告するための定期的なミーティングである。",
      "プロジェクトのリスクを評価するためのツールである。"
    ],
    "answer": 0,
    "explanation": "プロジェクト憲章はプロジェクトの目的、範囲、主要ステークホルダーを明確にする文書である。"
  },
  {
    "q": "プロジェクトマネジメントのプロセスのうち、計画プロセスグループ内で実施するプロセスはどれか。",
    "options": [
      "プロジェクト憲章の作成",
      "スコープの定義",
      "プロジェクト作業の監視・コントロール",
      "プロジェクト終結の指揮・マネジメント"
    ],
    "answer": 1,
    "explanation": "スコープの定義は計画プロセスグループで行うプロセスである。"
  },
  {
    "q": "工程管理図表に関する記述のうち、ガントチャートの特徴はどれか。",
    "options": [
      "プロジェクトの進捗を視覚的に表現し、各タスクの開始日と終了日を示す。",
      "プロジェクトのタスク間の依存関係を示し、クリティカルパスを特定する。",
      "プロジェクトのリスクを評価し、リスク対応策を計画する。",
      "プロジェクトのコストを管理し、予算内での遂行を支援する。"
    ],
    "answer": 0,
    "explanation": "ガントチャートは作業の開始日と終了日を示し進捗を可視化する図である。"
  }
]